app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'rajangdavis@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1
---
def create
		# Find the user that is trying to log in
		u = User.where(email: params[:user][:email]).first