app/controllers/streams_controller.rb

SELECT  "streams".* FROM "streams"  WHERE "streams"."id" = $1 LIMIT 1  [["id", 0]]
---
	def edit
		@stream = Stream.find(params[:id])

SELECT  "streams".* FROM "streams"  WHERE "streams"."id" = $1 LIMIT 1  [["id", 22]]
UPDATE "streams" SET "description" = $1, "name" = $2, "updated_at" = $3, "user_id" = $4 WHERE "streams"."id" = 26  [["description", "this is a test\r\n"], ["name", "This is a test"], ["updated_at", "2014-11-21 03:13:45.046782"], ["user_id", 2]]
---
	def update
		@stream = Stream.find(params[:id])
		if @stream.update_attributes(stream_params)

INSERT INTO "streams" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@stream = Stream.new(params[:user_id])
		if @stream.save