app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "streams".* FROM "streams"  WHERE "streams"."user_id" = 2
---
	def show
		@user = User.find(params[:id])
		@streams = Stream.where(:user_id => @user.id)

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
def create
    @user = User.new(user_params)

    # respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL  ORDER BY "users"."id" ASC LIMIT 1
---
	def set_user
      @user = User.find(params[:id])